---
type: VertexStreamPositionNormalColored
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 2
tags: [revit-api, class]
---

# VertexStreamPositionNormalColored

`Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddVertex | 2017 | `public void AddVertex ( VertexPositionNormalColored vertex )` |
| Method | AddVertices | 2017 | `public void AddVertices ( IList < VertexPositionNormalColored > vertices )` |